{
    "Header": {
        "Item1" : "About me",
        "Item2" : "Experience",
        "Item3" : "Projects",
        "Item4" : "Contact",
        "cvBtn" : "Resume",
        "cvName": "CV_Gaurav_Khatwani.pdf"
    },
    "Banner": {
        "Pretitle": "Hello! My name is",
        "Description": "I have <span class='underline'>4 years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> and sometimes in <span class='underline'>Laravel</span> applying good practices and development standards.",
        "ActionBtn": "Get in touch"
    },
    "About": {
        "Title": "About me",
        "Paragraphs": [
            "In my <span class='underline'>4 years as a developer</span>, I seek to train every day. I have worked writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covering backend developer roles with <span class='underline'>Laravel and Mysql</span>. I have led teams having empathy, exercising motivation to partners, and setting plans and goals together.",
            "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
            "Some of the technologies that I have trained and worked on include (but are not limited to):"
        ]
    },
    "Experience":{
        "Title": "Experience",
        "Jobs": [{
                "Tab": "Microsoft",
                "Title": "Tech Consultant FTE",
                "Logo": "./../../../../assets/images/jobs/microsoft.png",
                "Date": "August 2022 - Present",
                "Description": [
                  "Participated in refactoring majority of a project's codebase within 2 weeks, increasing the code quality rating by over 90% and ensuring code reusability.",
                  "Developed numerous end-to-end APIs single-handedly using .NET Core and Azure services, incorporating best practices to ensure flexible and scalable code.",
                  "Improved the automation framework for API testing, allowing the framework to run an average of 10 test cases at once as opposed to only a single test case at a time.",
                  "Chosen as the Development Lead for a batch of interns at Microsoft, guiding them to build a 'Warehouse Management System'."
                ]
            },
            {
                "Tab": "Microsoft",
                "Title": "Tech Consultant Intern",
                "Logo": "./../../../../assets/images/jobs/microsoft.png",
                "Date": "May 2016 - Present",
                "Description": [
                  "Developed a learning portal for Microsoft employees using .NET Core, Vue.JS, and Azure Services.",
                  "Utilized Azure services like Azure Active Directory for Multi-Factor Authentication and Azure App Service for hosting the website, with room for future scalability."
                ]
            },
            {
                "Tab": "Arcon",
                "Title": "Software Developer Intern",
                "Logo": "./../../../../assets/images/jobs/arcon.png",
                "Date": "July 2017 - October 2018",
                "Description": [
                  "Developed new automation scripts for the company’s application in Java using the Selenium framework.",
                  " Increased performance by 50% in the existing scripts by optimizing them using data structures."
                ]
            },
            {
                "Tab": "UtokSmart",
                "Title": "Web Developer Intern",
                "Logo": "./../../../../assets/images/jobs/utoksmart.png",
                "Date": "February 2016 - May 2017",
                "Description": [
                  "Creation of WordPress templates with ACF, functional programming in Javascript / jQuery, styles in SASS",
                  "integration of design improvements, and template loading times.",
                  "Effective communication with the design team, working with Avocode / Figma."
                ]
            },
            {
                "Tab": "K.J.S.C.E",
                "Title": "Python Developer Intern",
                "Logo": "./../../../../assets/images/jobs/kjsce.png",
                "Date": "November 2015 - December 2016",
                "Description": [
                  "Programming of new functionalities for an existing employee management platform made in Angular and ExpressJS.",
                  "Perform refactoring of old code. Ensuring compatibility of every dependency in every update, along with regular Angular update as well."
                ]
            },
            {
                "Tab": "K.J.S.C.E",
                "Title": "Flask Developer Intern",
                "Logo": "./../../../../assets/images/jobs/kjsce.png",
                "Date": "January 2015 - July 2015",
                "Description": ["Teaching English at a basic level to an enrollment of more than 200 students."]
            }
        ]},
    "FeatureProjects":{
        "Title": "My projects",
        "Label": "Featured Project",
        "Projects": [{
                "Title": "Book My Turf",
                "Description": "Monitoring application made from scratch with auth module, <span class='underline'>configurable graphics</span>, <span class='underline'>configurable alarms</span>, and <span class='underline'>user management</span>. It also has feedback form logic for parameter configuration.",
                "imgs": [
                    "assets/images/BookMyTurf/BookMyTurf-login.png",
                    "assets/images/BookMyTurf/BookMyTurf-home.png"
                ],
                "Technologies": ["Flutter", "Dart", "Firebase"]
            },
            {
                "Title": "VisuallyPaired",
                "Description": "Health plan quote that has a search engine with which advanced queries are made. Plans are displayed based on the user's age, monthly income, and location. It has <span class='underline'>online chat</span, <span class='underline'>contact form</span>, <span class='underline'>notification system by whatsapp and mail</span>, <span class='underline'>auth</span>, and <span class='underline'>internet information management through the role of administrator.</span>",
                "imgs": [
                    "assets/images/VisuallyPaired/VisuallyPaired-home.png",
                    "assets/images/VisuallyPaired/VisuallyPaired-call.png",
                    "assets/images/VisuallyPaired/VisuallyPaired-message.png",
                    "assets/images/VisuallyPaired/VisuallyPaired-currency.png",
                    "assets/images/VisuallyPaired/VisuallyPaired-calculate.png"
                ],
                "Technologies": ["Flutter", "Dart", "Firebase", "Alan AI", "ML"]
            }]
        },
    "OtherProjects":{
        "Title": "More projects",
        "Projects": [{
                "Title": "SkillGrader",
                "Description": "The educational platform facilitates university teachers in uploading lecture recordings, tests, and grading student submissions. Students can access the recordings, prepare for tests, and submit their assignments, earning credits based on their grades to fulfill course completion requirements.",
                "ghLink": "https://github.com/gaurav148/SkillGrader",
                "Technologies": ["NodeJS", "Express", "MySQL", "HTML", "CSS"]
            },
            {
                "Title": "Caption Generator",
                "Description": "The website enables users to upload pictures and automatically generates captions using various NLP techniques, including tokenization, stop words removal, and next word prediction. ",
                "ghLink": "https://github.com/gaurav148/Caption-Generator",
                "Technologies": ["HTML", "CSS", "NLP", "Machine Learning"]
            },
            {
                "Title": "QTalk",
                "Description": "The social chat app enables users to communicate using various media, with a child-lock feature to prevent sharing inappropriate content and discourage offensive language. Additionally, it offers advanced features such as a fake news detector and text extraction from images.",
                "ghLink": "https://github.com/gaurav148/QTalk",
                "Technologies": ["Flutter", "Dart", "Firebase", "ML"]
            },
            {
                "Title": "StudySmart GRE",
                "Description": "A GRE website which offers flashcards and quizzes to help students improve their verbal and math skills. It provides customized study materials to prepare for the exam effectively.",
                "ghLink": "https://github.com/gaurav148/gre",
                "Technologies": ["Python", "Flask", "PostgreSQL", "HTML", "CSS"]
            },
            {
                "Title": "Blogify Hub",
                "Description": "A blog platform where users can authenticate, create their own blogs, and explore content written by others. Users have the flexibility to include pictures, emojis, and text in their blog posts.",
                "ghLink": "https://github.com/gaurav148/DjangoProject",
                "Technologies": ["Python", "Django", "MySQL", "HTML", "CSS"]
            }]
        },
    "Contact":{
        "Pretitle": "What’s Next",
        "Title": "Get in touch!",
        "Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
        "Btn": "Say Hello"
    }

}